{
    "aboveTheFold": {
        "title": "Entwickler"
    },
    "menu": {
        "navLinks": {
            "about": "Über mich",
            "skills": "Meine Skills",
            "portfolio": "Portfolio",
            "contact": "Kontakt"
        }
    },
    "about": {
        "title": "Über mich",
        "quote": "Jede großartige Idee beginnt mit einer einfachen Zeile Code.",
        "introduction": "Hi, ich bin Preston!",
        "description": {
            "paragraph1": "Frontend Entwickler und Musiker aus Leidenschaft.",
            "paragraph2": "Mit über zehn Jahren Erfahrung als professioneller Sänger und Kontrabassist bringe ich eine einzigartige Kombination aus Kreativität und technischer Expertise mit und habe gelernt, wie man aus einer einfachen Idee etwas Großes entstehen lässt – seien es ein paar Noten, eine Melodie oder ein paar Zeilen Code. Diese kreative Herangehensweise ermöglicht es mir, beim Programmieren und Lösen komplexer Aufgaben neue Perspektiven einzunehmen und innovative Lösungen zu entwickeln.",
            "paragraph3": "Während meiner Ausbildung als Frontend-Entwickler habe ich umfangreiche praktische Erfahrungen in der Entwicklung und Erstellung von Webseiten und Business-Apps gesammelt, insbesondere mit dem Framework Angular und TypeScript.",
            "paragraph4": "Ich lade Sie herzlich ein, mein Portfolio zu erkunden und sich einen Eindruck von den Projekten zu verschaffen, die ich während meiner Ausbildung realisiert habe. Wenn Sie an einer Zusammenarbeit interessiert sind oder einfach nur Hallo sagen möchten, freue ich mich darauf, von Ihnen zu hören."
        },
        "button": "Lass uns reden"
    },
    "skills": {
        "title": "Meine Skills"
    },
    "portfolio": {
        "title": "Portfolio",
        "subtitle": "Erkunden Sie eine Auswahl meiner Projekte - Interagieren Sie mit den Projekten, um meine Fähigkeiten in Aktion zu sehen.",
        "projects": {
            "dabubble": {
                "description": "Eine von Slack inspirierte Chat-Messenger-App ermöglicht es Benutzern, über Kanäle oder Direktnachrichten miteinander zu kommunizieren."
            },
            "join": {
                "description": "Vom Kanban-System inspirierter Aufgabenmanager. Erstellen und organisieren Sie Aufgaben mithilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu."
            },
            "cybercity": {
                "description": "2D-Pixel-Art-Arcade-Spiel basierend auf einem objektorientierten Ansatz. Rette Cyber ​​City vor der Invasion der Wespen Königin."
            },
            "pokedex": {
                "description": "Based on the PokéAPI a simple library that provides and catalogues pokemon information."
            }
        }
    },
    "contact": {
        "title": "Sag Hi!",
        "subtitle": "Auf der Suche nach einem Frontend Entwickler?",
        "description": "Lass Sie uns über Ihre Ideen sprechen und wie wir sie verwirklichen.",
        "form": {
            "name": {
                "label": "Ihr Name",
                "placeholder": "Ihr Name",
                "errors": {
                    "required": "Bitte geben Sie Ihren Namen ein."
                }
            },
            "email": {
                "label": "Ihre Email",
                "placeholder": "Ihre Email",
                "errors": {
                    "required": "Bitte geben Sie Ihre Email Adresse ein."
                }
            },
            "message": {
                "label": "Ihre Nachricht",
                "placeholder": "Ihre Nachricht",
                "errors": {
                    "required": "Bitte geben Sie eine Nachricht."
                }
            },
            "privacy": {
                "title": "Datenschutzerklärung",
                "label_01": "Ich habe die ",
                "label_02": " gelesen und stimme der Verarbeitung meiner Daten wie beschrieben zu.",
                "errors": {
                    "required": "Bitte stimmen Sie der Datenschutzerklärung zu."
                }
            },
            "button": {
                "label": "Nachricht senden"
            }
        },
        "footer": {
            "imprint": {
                "title": "Impressum"
            }
        }
    }
}