{
    "aboveTheFold": {
        "title": "Entwickler",
        "sendMessageBtn": "Nachricht senden"
    },
    "mySkills": {
        "learning": "Kontinuierlich lernend"
    },
    "menu": {
        "navLinks": {
            "about": "Über mich",
            "skills": "Meine Skills",
            "portfolio": "Portfolio",
            "contact": "Kontakt"
        }
    },
    "about": {
        "title": "Über mich",
        "quote": "Effiziente und klare Code-Strukturen bilden die Grundlage für innovative und nachhaltige Lösungen.",
        "introduction": "Hallo, ich bin Preston,",
        "description": {
            "paragraph1": "leidenschaftlicher Frontend-Entwickler aus Deutschland mit Schwerpunkt auf Angular, TypeScript und JavaScript. Mein Fokus liegt auf sauberem, wartbarem Code und skalierbaren Lösungen, die moderne Technologien mit klarer Struktur verbinden.",
            "paragraph2": "Ich entwickle dynamische, responsive Anwendungen mit durchdachter Architektur, hoher Performance und starkem Nutzererlebnis. Dabei orientiere ich mich an Best Practices und arbeite agil, um gemeinsam im Team effiziente und nachhaltige Lösungen umzusetzen.",
            "paragraph3": "Passt mein Profil zu Ihren Projekten? Dann freue ich mich darauf, von Ihnen zu hören."
        },
        "button": "Lass uns reden"
    },
    "skills": {
        "title": "Meine Skills"
    },
    "portfolio": {
        "title": "Portfolio",
        "subtitle": "Erkunden Sie eine Auswahl meiner Projekte - Interagieren Sie mit den Projekten, um meine Fähigkeiten in Aktion zu sehen.",
        "projects": {
            "hcloud": {
                "description": "HCloud Vision ist eine Cloud-Dashboard-Demo, inspiriert von der Hetzner Cloud Console. Die App zeigt Server, Standorte und Systemstatus in einem modernen UI mit Light- und Dark-Mode. Ein Mock-Modus simuliert realistische API-Daten, während ein Serverless-Proxy sicheren Zugriff auf echte Cloud-Endpunkte ermöglicht."
            },
            "nexchat": {
                "description": "NexChat ist eine Chat-App mit Echtzeitkommunikation, inspiriert von Slack. Sie bietet Channels, Direktnachrichten, Threads, Emoji-Reaktionen und Mentions für eine klare und strukturierte Teamkommunikation."
            },
            "join": {
                "description": "Vom Kanban-System inspirierter Aufgabenmanager. Erstellen und organisieren Sie Aufgaben mithilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu."
            },
            "cybercity": {
                "description": "Vom Arcade-Feeling inspirierter 2D-Sidescroller im Cyberpunk-Stil. Objektorientiert entwickelt mit klarer Spiellogik und gegnerbasierter Kollisionsabfrage für ein authentisches Arcade-Erlebnis."
            }
        }
    },
    "contact": {
        "title": "Sag Hi!",
        "subtitle": "Auf der Suche nach einem Software Entwickler?",
        "description": "Lass Sie uns über Ihre Ideen sprechen und wie wir sie verwirklichen.",
        "form": {
            "name": {
                "label": "Ihr Name",
                "placeholder": "Max Mustermann",
                "errors": {
                    "required": "Bitte geben Sie Ihren Namen ein."
                }
            },
            "email": {
                "label": "Ihre E-Mail-Adresse",
                "placeholder": "max.mustermann@example.com",
                "errors": {
                    "required": "Bitte geben Sie Ihre Email Adresse ein."
                }
            },
            "message": {
                "label": "Ihre Nachricht",
                "placeholder": "Hallo Preston, ich habe eine spannende Projektidee...",
                "errors": {
                    "required": "Bitte geben Sie eine Nachricht."
                }
            },
            "privacy": {
                "title": "Datenschutzerklärung",
                "label_01": "Ich habe die ",
                "label_02": " gelesen und stimme der Verarbeitung meiner Daten wie beschrieben zu.",
                "errors": {
                    "required": "Bitte stimmen Sie der Datenschutzerklärung zu."
                }
            },
            "button": {
                "label": "Nachricht senden"
            }
        }
    },
    "footer": {
        "imprint": {
            "title": "Impressum"
        }
    },
    "imprint": {
        "title": "Impressum",
        "subtitle": "Verantwortlicher gemäß § 5 TMG ist:"
    },
    "privacy": {
        "title": "Datenschutz-Erklärung",
        "preamble": {
            "paragraph1": "Personenbezogene Daten (nachfolgend zumeist nur 'Daten' genannt) werden von uns nur im Rahmen der Erforderlichkeit sowie zum Zwecke der Bereitstellung eines funktionsfähigen und nutzerfreundlichen Internetauftritts, inklusive seiner Inhalte und der dort angebotenen Leistungen, verarbeitet.",
            "paragraph2": "Gemäß Art. 4 Ziffer 1. der Verordnung (EU) 2016/679, also der Datenschutz-Grundverordnung (nachfolgend nur 'DSGVO' genannt), gilt als 'Verarbeitung' jeder mit oder ohne Hilfe automatisierter Verfahren ausgeführter Vorgang oder jede solche Vorgangsreihe im Zusammenhang mit personenbezogenen Daten, wie das Erheben, das Erfassen, die Organisation, das Ordnen, die Speicherung, die Anpassung oder Veränderung, das Auslesen, das Abfragen, die Verwendung, die Offenlegung durch Übermittlung, Verbreitung oder eine andere Form der Bereitstellung, den Abgleich oder die Verknüpfung, die Einschränkung, das Löschen oder die Vernichtung.",
            "paragraph3": "Mit der nachfolgenden Datenschutzerklärung informieren wir Sie insbesondere über Art, Umfang, Zweck, Dauer und Rechtsgrundlage der Verarbeitung personenbezogener Daten, soweit wir entweder allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung entscheiden. Zudem informieren wir Sie nachfolgend über die von uns zu Optimierungszwecken sowie zur Steigerung der Nutzungsqualität eingesetzten Fremdkomponenten, soweit hierdurch Dritte Daten in wiederum eigener Verantwortung verarbeiten.",
            "structure": {
                "title": "Unsere Datenschutzerklärung ist wie folgt gegliedert:",
                "list": {
                    "section1": "1. Informationen über den Verantwortlichen",
                    "section2": "2. Rechte der Nutzer und Betroffenen",
                    "section3": "3. Informationen zur Datenverarbeitung"
                }
            }
        },
        "section1": {
            "title": "I. Informationen über den Verantwortlichen",
            "paragraph1": "Verantwortlicher Anbieter dieses Internetauftritts im datenschutzrechtlichen Sinne ist:",
            "phone": "Telefon: ",
            "mail": "E-Mail: "
        },
        "section2": {
            "title": "II. Rechte der Nutzer und Betroffenen",
            "paragraph1": "Mit Blick auf die nachfolgend noch näher beschriebene Datenverarbeitung haben die Nutzer und Betroffenen das Recht",
            "list": {
                "point1": "auf Bestätigung, ob sie betreffende Daten verarbeitet werden, auf Auskunft über die verarbeiteten Daten, auf weitere Informationen über die Datenverarbeitung sowie auf Kopien der Daten (vgl. auch Art. 15 DSGVO)",
                "point2": "auf Berichtigung oder Vervollständigung unrichtiger bzw. unvollständiger Daten (vgl. auch Art. 16 DSGVO)",
                "point3": "auf unverzügliche Löschung der sie betreffenden Daten (vgl. auch Art. 17 DSGVO), oder, alternativ, soweit eine weitere Verarbeitung gemäß Art. 17 Abs. 3 DSGVO erforderlich ist, auf Einschränkung der Verarbeitung nach Maßgabe von Art. 18 DSGVO",
                "point4": "auf Erhalt der sie betreffenden und von ihnen bereitgestellten Daten und auf Übermittlung dieser Daten an andere Anbieter/Verantwortliche (vgl. auch Art. 20 DSGVO)",
                "point5": "auf Beschwerde gegenüber der Aufsichtsbehörde, sofern sie der Ansicht sind, dass die sie betreffenden Daten durch den Anbieter unter Verstoß gegen datenschutzrechtliche Bestimmungen verarbeitet werden (vgl. auch Art. 77 DSGVO)."
            },
            "paragraph2": "Darüber hinaus ist der Anbieter dazu verpflichtet, alle Empfänger, denen gegenüber Daten durch den Anbieter offengelegt worden sind, über jedwede Berichtigung oder Löschung von Daten oder die Einschränkung der Verarbeitung, die aufgrund der Artikel 16, 17 Abs. 1, 18 DSGVO erfolgt, zu unterrichten. Diese Verpflichtung besteht jedoch nicht, soweit diese Mitteilung unmöglich oder mit einem unverhältnismäßigen Aufwand verbunden ist. Unbeschadet dessen hat der Nutzer ein Recht auf Auskunft über diese Empfänger.",
            "paragraph3": "Ebenfalls haben die Nutzer und Betroffenen nach Art. 21 DSGVO das Recht auf Widerspruch gegen die künftige Verarbeitung der sie betreffenden Daten, sofern die Daten durch den Anbieter nach Maßgabe von Art. 6 Abs. 1 lit. f) DSGVO verarbeitet werden. Insbesondere ist ein Widerspruch gegen die Datenverarbeitung zum Zwecke der Direktwerbung statthaft."
        },
        "section3": {
            "title": "III. Informationen zur Datenverarbeitung",
            "paragraph1": "Ihre bei Nutzung dieses Internetauftritts verarbeiteten Daten werden gelöscht oder gesperrt, sobald der Zweck der Speicherung entfällt, der Löschung der Daten keine gesetzlichen Aufbewahrungspflichten entgegenstehen und nachfolgend keine anderslautenden Angaben zu einzelnen Verarbeitungsverfahren gemacht werden.",
            "paragraph2": {
                "title": "Kontaktmöglichkeit",
                "content1": "Sofern Sie per Kontaktformular oder E-Mail mit uns in Kontakt treten, werden die dabei von Ihnen angegebenen Daten zur Bearbeitung Ihrer Anfrage genutzt. Die Angabe der Daten ist zur Bearbeitung und Beantwortung Ihre Anfrage erforderlich – ohne deren Bereitstellung können wir Ihre Anfrage nicht oder allenfalls eingeschränkt beantworten.",
                "content2": "Rechtsgrundlage für diese Verarbeitung ist Art. 6 Abs. 1 lit. b) DSGVO.",
                "content3": "Ihre Daten werden gelöscht, sofern Ihre Anfrage abschließend beantwortet worden ist und der Löschung keine gesetzlichen Aufbewahrungspflichten entgegenstehen, wie bspw. bei einer sich etwaig anschließenden Vertragsabwicklung."
            },
            "paragraph3": {
                "title": "LinkedIn",
                "content": "LinkedIn Ireland Unlimited Company, Wilton Plaza, Wilton Place, Dublin 2, Irland, ein Tochterunternehmen der LinkedIn Corporation, 1000 W. Maude Avenue, Sunnyvale, CA 94085 USA."
            },
            "paragraph4": {
                "title": "GitHub",
                "content": "GitHub, Inc., 88 Colin P Kelly Jr Street, San Francisco, CA 94107, USA, ein Tochterunternehmen der Microsoft Corporation."
            }
        }
    }
}